42-rails-review-validations-serializers/app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
    def index
        activities = Activity.all

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 3]]
---
    def destroy
        # activity = Activity.find_by(id: params[:id])
        activity = Activity.find(params[:id])

        if activity
            activity.destroy