42-rails-review-validations-serializers/app/controllers/campers_controller.rb

SELECT "campers".* FROM "campers"
---
    def index
        campers = Camper.all

SELECT "campers".* FROM "campers" WHERE "campers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show #"/campers/:id"
        # byebug
        camper = Camper.find(params[:id])

INSERT INTO "campers" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Zoe"], ["age", 11], ["created_at", "2021-06-11 15:54:30.419439"], ["updated_at", "2021-06-11 15:54:30.419439"]]
---
    def create
        # byebug
        camper = Camper.new(camper_params)

        if camper.valid?
            camper.save