42-rails-review-validations-serializers/app/controllers/signups_controller.rb

INSERT INTO "signups" ("camper_id", "activity_id", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["camper_id", 1], ["activity_id", 8], ["time", 9], ["created_at", "2021-06-11 16:18:07.220631"], ["updated_at", "2021-06-11 16:18:07.220631"]]
---
    def create
        signup = Signup.new(signup_params)

        if signup.valid?
            signup.save