40-Rails-CRUD-App/app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners"
---
    def index
        # puts "Index action!!"
        # byebug
        # puts "End of action!!"
        # @name = "Vidhi" # to show in rails view

        # @results = Owner.all
        owners = Owner.all

INSERT INTO "owners" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Vidhi"], ["age", 28], ["created_at", "2021-06-08 14:42:47.516634"], ["updated_at", "2021-06-08 14:42:47.516634"]]
---
    def create
        # byebug
        owner = Owner.create(owner_params)

UPDATE "owners" SET "name" = ?, "updated_at" = ? WHERE "owners"."id" = ?  [["name", "Vidhi"], ["updated_at", "2021-06-08 14:54:25.136883"], ["id", 3]]
---
    def update
        # byebug
        # owner = Owner.find(params[:id])
        # owner = find_owner
        @owner.update(owner_params)

DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 3]]
---
    def destroy
        # byebug
        @owner.destroy

SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_owner
        @owner = Owner.find(params[:id])