39-Rails-Intro/app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners"
---
    def index
        # puts "Index action!!"
        # byebug
        # puts "End of action!!"
        # @name = "Vidhi" # to show in rails view

        owners = Owner.all